# TrySmallerBarType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..TrySmallerBarType Property
BuiltInFailures..::..RebarFailures Class See Also
---
Rebar Bend Diameter is too large. Try a smaller Bar Type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrySmallerBarType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrySmallerBarType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrySmallerBarType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace